### Essential NumPy and Pandas Functions for Data Analysis

Let's look at practical code snippets that demonstrate the most useful NumPy and pandas methods for data analysis in Python. You can use these in a Jupyter notebook for experimentation and workflow mastery.

#### NumPy Basics for Data Analysis
Import NumPy:

In [1]:
import numpy as np

1. Creating Arrays

In [2]:
arr = np.array([1, 2, 3, 4])            # 1D array
matrix = np.array([[1, 2], [3, 4]])     # 2D array
zeros = np.zeros((2, 3))                # 2x3 array of zeros
ones = np.ones((2, 3))                  # 2x3 array of ones
rnd = np.random.rand(2, 3)              # 2x3 array of random floats

In [3]:
rnd

array([[0.46889046, 0.5404419 , 0.12075745],
       [0.038039  , 0.70086168, 0.61941089]])

2. Array Shape, Reshape, Flatten

In [4]:
print(arr.shape)                # (4,)
reshaped = matrix.reshape((4, 1))   # Reshape to 4 rows, 1 column
flat = matrix.ravel()               # Flatten to 1D array

(4,)

In [5]:
matrix

array([[1, 2],
       [3, 4]])

3. Indexing and Slicing

In [6]:
print(matrix[0, 1])    # element at first row, second column
print(arr[1:3])        # slice elements 1 to 2

2
[2 3]

4. Basic Math Operations

In [7]:
a = np.array([10, 20, 30])
b = np.array([1, 2, 3])
print(a + b)           # [11 22 33]
print(a - b)           # [ 9 18 27]
print(a * b)           # [10 40 90]
print(a / b)           # [10. 10. 10.]

[11 22 33]
[ 9 18 27]
[10 40 90]
[10. 10. 10.]

5. Aggregation and Stats

In [8]:
np.sum(arr)                 # 10
np.mean(arr)                # 2.5
np.std(arr)                 # Standard deviation
np.min(arr), np.max(arr)    # Min and max values

(np.int64(1), np.int64(4))

6. Dot Product, Matrix Ops

In [9]:
a = np.array([1, 2, 3])
b = np.array([4, 5, 6])
dot = np.dot(a, b)          # 1*4 + 2*5 + 3*6 = 32
mat = np.array([[1, 2], [3, 4]])
mat2 = np.array([[5, 6], [7, 8]])
matprod = np.matmul(mat, mat2) # Matrix multiplication

7. Logical and Filtering

In [10]:
arr[arr > 2]                # Returns [3, 4]
np.where(arr > 2)           # Indices where condition is true

(array([2, 3]),)

8. Random Sampling

In [11]:
np.random.randint(0, 100, size=5) # 5 random ints 0-99
np.random.choice([0, 1], size=10) # 10 random 0s or 1s

array([1, 1, 0, 0, 0, 0, 1, 0, 0, 0])

#### Pandas Basics for Data Analysis
Import pandas:

In [12]:
import pandas as pd

1. Creating DataFrames

In [13]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data) # Create DataFrame

In [14]:
df

   A  B
0  1  4
1  2  5
2  3  6

2. Inspecting Data

In [15]:
df.head()                # First 5 rows
df.tail(3)                # Last 3 rows
df.info()                 # DataFrame info + datatypes
df.describe()             # Summary statistics

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
dtypes: int64(2)
memory usage: 180.0 bytes

         A    B
count  3.0  3.0
mean   2.0  5.0
std    1.0  1.0
min    1.0  4.0
25%    1.5  4.5
50%    2.0  5.0
75%    2.5  5.5
max    3.0  6.0

3. Selecting Data

In [16]:
df['A']                   # Get column A
df.loc[0]                 # Row by label (index 0)
df.iloc[1:3]              # Rows 1-2 by position
df[df['A'] > 1]           # Filter rows where A > 1

   A  B
1  2  5
2  3  6

4. Adding/Dropping Columns

In [17]:
df['C'] = df['A'] + df['B']     # Add new column
new_df = df.drop('B', axis=1)   # Drop column B
new_df

   A  C
0  1  5
1  2  7
2  3  9

5. Missing Values & Types

In [18]:
df.isnull().sum()               # Missing values per column
df.fillna(0)                    # Replace NaNs with 0
df['A'] = df['A'].astype(float) # Change column type

6. Grouping and Aggregation

In [19]:
grouped = df.groupby('A').sum()   # Sum columns, grouped by values in A
df['A'].value_counts()            # Count unique values in A
grouped

     B  C
A
1.0  4  5
2.0  5  7
3.0  6  9

7. Sorting

In [20]:
df.sort_values('B', ascending=False)  # Sort by column B

     A  B  C
2  3.0  6  9
1  2.0  5  7
0  1.0  4  5

8. Reading/Writing Files

In [21]:
df.to_csv('mydata.csv') # Save to CSV
df = pd.read_csv('mydata.csv') # Load from CSV
df.head()

   Unnamed: 0    A  B  C
0           0  1.0  4  5
1           1  2.0  5  7
2           2  3.0  6  9

9. Apply/Map Functions

In [22]:
df['A_squared'] = df['A'].apply(lambda x: x**2) # Apply to column
df['B_label'] = df['B'].map({4: 'Low', 5: 'Med', 6: 'High'}) # Map values
df.sample(3)

   Unnamed: 0    A  B  C  A_squared B_label
1           1  2.0  5  7        4.0     Med
0           0  1.0  4  5        1.0     Low
2           2  3.0  6  9        9.0    High

### Task:

- Generated a Synthetic Dataset with columns of `age`, `salary`, `department`, `years_experience`, and `is_manager`.

In [23]:
np.random.seed(42) # For reproducibility
n_samples = 100 # Number of samples

data = {
    'age': np.random.randint(18, 60, size=n_samples),
    'salary': np.random.randint(30000, 120000, size=n_samples),
    'department': np.random.choice(['IT', 'HR', 'Finance', 'Marketing'], size=n_samples),
    'years_experience': np.round(np.random.normal(5, 2, size=n_samples), 1),
    'is_manager': np.random.choice([0, 1], size=n_samples)
}
df = pd.DataFrame(data)

Q1. View data structure

In [26]:
df

    age  salary department  years_experience  is_manager
0    56   38392         IT              -0.8           0
1    46   60535  Marketing               3.4           1
2    32  108603         HR               5.0           1
3    25   82256         HR               4.2           1
4    38  119135         HR               4.1           1
..  ...     ...        ...               ...         ...
95   59   82662         IT               4.0           0
96   56   42688         HR               4.4           1
97   58   55342  Marketing               6.0           0
98   45   67157         HR              11.4           0
99   24   97863         HR               5.2           1

[100 rows x 5 columns]

Q2. Get DataFrame Info and Summary Stats

In [59]:
df.info()                
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   age               100 non-null    int32
 1   salary            100 non-null    int32
 2   department        100 non-null    object
 3   years_experience  100 non-null    float64
 4   is_manager        100 non-null    int64
 5   bonus             100 non-null    float64
 6   seniority         100 non-null    object
dtypes: float64(2), int32(2), int64(1), object(2)
memory usage: 4.8+ KB

              age         salary  years_experience  is_manager         bonus
count  100.000000     100.000000        100.000000  100.000000    100.000000
mean    37.910000   77809.160000          4.823000    0.470000   7780.916000
std     12.219454   26058.643576          2.237822    0.501614   2605.864358
min     18.000000   30206.000000         -0.800000    0.000000   3020.600000
25%     26.750000   55141.000000          3.475000    0.000000   5514.100000
50%     38.000000   80932.000000          4.700000    0.000000   8093.200000
75%     46.250000   98107.250000          6.000000    1.000000   9810.725000
max     59.000000  119474.000000         11.400000    1.000000  11947.400000

Q3. Do Simple Numpy Operations

In [58]:
salary_array = df['salary'].to_numpy()
print("Shape: ",salary_array.shape)
print("Mean salary:", np.mean(salary_array))
print("Max salary:", np.max(salary_array))

required_s = np.where(salary_array < 70000)
print("Employees with salary greater than 70000:", np.size(required_s) )

print("Random 5 salaries: ", np.random.choice(salary_array, size=5))

Shape:  (100,)
Mean salary: 77809.16
Max salary: 119474
Employees with salary greater than 70000: 39
Random 5 salaries:  [103530  67157  54538  80015  45707]

Q4. Filtering and Indexing Rows

In [ ]:
# Filter: managers only
managers = df[df['is_manager'] == 1]
print(managers.head())

# Indexing: selecting rows 15 to 20
print(df.iloc[15:21])

# Selecting specific columns for first 5 rows
print(df.loc[0:4, ['age', 'salary', 'department']])

   age  salary department  years_experience  is_manager
1   46   60535  Marketing               3.4           1
2   32  108603         HR               5.0           1
3   25   82256         HR               4.2           1
4   38  119135         HR               4.1           1
6   36  107373    Finance               6.7           1
    age  salary department  years_experience  is_manager
15   39   57266         IT               5.8           1
16   19   82992    Finance               4.7           0
17   41  112948  Marketing               6.7           1
18   47   36910  Marketing               7.6           0
19   55   30206    Finance               2.3           0
20   19  117054  Marketing               6.7           0
   age  salary department
0   56   38392         IT
1   46   60535  Marketing
2   32  108603         HR
3   25   82256         HR
4   38  119135         HR

Q5. Adding a Column

In [ ]:
# Add bonus column: 10% of salary
df['bonus'] = df['salary'] * 0.10

# Add seniority level based on years_experience
def seniority(years):
    if years < 3:
        return 'Junior'
    elif years < 7:
        return 'Mid'
    else:
        return 'Senior'

df['seniority'] = df['years_experience'].apply(seniority)

print(df.head())

   age  salary department  years_experience  is_manager    bonus seniority
0   56   38392         IT              -0.8           0   3839.2    Junior
1   46   60535  Marketing               3.4           1   6053.5       Mid
2   32  108603         HR               5.0           1  10860.3       Mid
3   25   82256         HR               4.2           1   8225.6       Mid
4   38  119135         HR               4.1           1  11913.5       Mid

Q6. Grouping and Aggregation

In [37]:
# Count of employees per department
count_by_dept = df.groupby('department').size()
print("Employee count by department:\n", count_by_dept)

# aggregation: mean and max salary by department
agg_by_dept = df.groupby('department')['salary'].agg(['mean', 'max'])
print("Salary stats by department:\n", agg_by_dept)

Employee count by department:
 department
Finance      24
HR           19
IT           21
Marketing    36
dtype: int64
Salary stats by department:
                     mean     max
department
Finance     83124.708333  117897
HR          73523.052632  119135
IT          75825.476190  117455
Marketing   77684.722222  119474